In [4]:
import numpy as np
import pandas as pd
heroes = pd.read_csv("heroes_information.csv")

In [5]:
heroes.head()

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,NaN,good,441.0
1,1,Abe Sapien,Male,blue,Icthyo Sapien,No Hair,191.0,Dark Horse Comics,blue,good,65.0
2,2,Abin Sur,Male,blue,Ungaran,No Hair,185.0,DC Comics,red,good,90.0
3,3,Abomination,Male,green,Human / Radiation,No Hair,203.0,Marvel Comics,NaN,bad,441.0
4,4,Abraxas,Male,blue,Cosmic Entity,Black,-99.0,Marvel Comics,NaN,bad,-99.0

In [6]:
from  pandasql import *

In [7]:
pysqldf = lambda q: sqldf(q,globals())

In [8]:
query0 = "select * from heroes limit(5)"

In [9]:
pysqldf(query0)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,None,good,441.0
1,1,Abe Sapien,Male,blue,Icthyo Sapien,No Hair,191.0,Dark Horse Comics,blue,good,65.0
2,2,Abin Sur,Male,blue,Ungaran,No Hair,185.0,DC Comics,red,good,90.0
3,3,Abomination,Male,green,Human / Radiation,No Hair,203.0,Marvel Comics,None,bad,441.0
4,4,Abraxas,Male,blue,Cosmic Entity,Black,-99.0,Marvel Comics,None,bad,-99.0

In [10]:
q1 = "select name from heroes limit(1)"

In [11]:
# Pregunta 1: A-Bomb
pysqldf(q1)

     name
0  A-Bomb

In [12]:
q2 = "select count(distinct Publisher)  from heroes"

In [13]:
# Pregunta 2: 24
pysqldf(q2)

   count(distinct Publisher)
0                         24

In [14]:
q3 = "select count(Height) from heroes where Height   > 200"

In [15]:
# Pregunta 3: 59
pysqldf(q3)

   count(Height)
0             59

In [26]:
q4 = "select count(Height) from heroes where ((Height   > 200) and (Race = 'Human'))"

In [27]:
# Pregunta 4: 12
pysqldf(q4)

   count(Height)
0             12

In [33]:
q5 = "select count(Weight) from heroes where Weight between 100 and 200"

In [34]:
# Pregunta 5: 98
pysqldf(q5)

   count(Weight)
0             98

In [39]:
q6 = "select count(`Eye Color`) from heroes where `Eye Color` in ('red','blue')"

In [40]:
# Preunta 6: 271
pysqldf(q6)

   count(`Eye Color`)
0                 271

In [50]:
q7 = "select count(Race) from heroes where (Race in ('Human','Mutant') and `Hair Color` = 'Green') or  (Race = 'Vampire' and `Hair Color`='Black')"

In [51]:
# Preunta 7: 5
pysqldf(q7)

   count(Race)
0            5

In [52]:
q8 = "select name from heroes order by Race desc limit(1)"

In [53]:
# Preunta 8: Solomon Grundy
pysqldf(q8)

             name
0  Solomon Grundy

In [54]:
q9 = "select Gender, count(Gender) from heroes group by Gender"

In [56]:
# Preunta 9: 200 female, 505 male
pysqldf(q9)

   Gender  count(Gender)
0    None              0
1  Female            200
2    Male            505

In [71]:
q10 = "select Publisher from heroes group by Publisher having count(Publisher) > 15 "

In [72]:
# Preunta 10: solamente 4 casas publicadoras tienen más de 15 heroes
pysqldf(q10)

           Publisher
0          DC Comics
1  Dark Horse Comics
2      Marvel Comics
3       NBC - Heroes